# ImagePath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..ImagePath Property
ViewDisplayBackground Class See Also
---
The path to the image file when the type is 'Image'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string ImagePath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ImagePath As String
	Get
```

Visual C++
---
```text
public:
property String^ ImagePath {
	String^ get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace